zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXA/periph2/PERI_SLCD.h
/*
** ###################################################################
**     Processors:          MCXA165VLH
**                          MCXA165VLL
**                          MCXA165VLQ
**                          MCXA165VPN
**                          MCXA166VLH
**                          MCXA166VLL
**                          MCXA166VLQ
**                          MCXA166VPN
**                          MCXA175VLH
**                          MCXA175VLL
**                          MCXA175VLQ
**                          MCXA175VPN
**                          MCXA176VLH
**                          MCXA176VLL
**                          MCXA176VLQ
**                          MCXA176VPN
**                          MCXA275VLH
**                          MCXA275VLL
**                          MCXA275VLQ
**                          MCXA275VPN
**                          MCXA276VLH
**                          MCXA276VLL
**                          MCXA276VLQ
**                          MCXA276VPN
**
**     Version:             rev. 1.0, 2024-03-26
**     Build:               b241120
**
**     Abstract:
**         CMSIS Peripheral Access Layer for SLCD
**
**     Copyright 1997-2016 Freescale Semiconductor, Inc.
**     Copyright 2016-2024 NXP
**     SPDX-License-Identifier: BSD-3-Clause
**
**     http:                 www.nxp.com
**     mail:                 support@nxp.com
**
**     Revisions:
**     - rev. 1.0 (2024-03-26)
**         Initial version based on Rev1 DraftC RM
**
** ###################################################################
*/

/*!
 * @file SLCD.h
 * @version 1.0
 * @date 2024-03-26
 * @brief CMSIS Peripheral Access Layer for SLCD
 *
 * CMSIS Peripheral Access Layer for SLCD
 */

#if !defined(SLCD_H_)
#define SLCD_H_                                  /**< Symbol preventing repeated inclusion */

#if (defined(CPU_MCXA165VLH) || defined(CPU_MCXA165VLL) || defined(CPU_MCXA165VLQ) || defined(CPU_MCXA165VPN))
#include "MCXA165_COMMON.h"
#elif (defined(CPU_MCXA166VLH) || defined(CPU_MCXA166VLL) || defined(CPU_MCXA166VLQ) || defined(CPU_MCXA166VPN))
#include "MCXA166_COMMON.h"
#elif (defined(CPU_MCXA175VLH) || defined(CPU_MCXA175VLL) || defined(CPU_MCXA175VLQ) || defined(CPU_MCXA175VPN))
#include "MCXA175_COMMON.h"
#elif (defined(CPU_MCXA176VLH) || defined(CPU_MCXA176VLL) || defined(CPU_MCXA176VLQ) || defined(CPU_MCXA176VPN))
#include "MCXA176_COMMON.h"
#elif (defined(CPU_MCXA275VLH) || defined(CPU_MCXA275VLL) || defined(CPU_MCXA275VLQ) || defined(CPU_MCXA275VPN))
#include "MCXA275_COMMON.h"
#elif (defined(CPU_MCXA276VLH) || defined(CPU_MCXA276VLL) || defined(CPU_MCXA276VLQ) || defined(CPU_MCXA276VPN))
#include "MCXA276_COMMON.h"
#else
  #error "No valid CPU defined!"
#endif

/* ----------------------------------------------------------------------------
   -- Device Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup Peripheral_access_layer Device Peripheral Access Layer
 * @{
 */


/*
** Start of section using anonymous unions
*/

#if defined(__ARMCC_VERSION)
  #if (__ARMCC_VERSION >= 6010050)
    #pragma clang diagnostic push
  #else
    #pragma push
    #pragma anon_unions
  #endif
#elif defined(__GNUC__)
  /* anonymous unions are enabled by default */
#elif defined(__IAR_SYSTEMS_ICC__)
  #pragma language=extended
#else
  #error Not supported compiler type
#endif

/* ----------------------------------------------------------------------------
   -- SLCD Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup SLCD_Peripheral_Access_Layer SLCD Peripheral Access Layer
 * @{
 */

/** SLCD - Size of Registers Arrays */
#define SLCD_LCDWFN_COUNT                         12u

/** SLCD - Register Layout Typedef */
typedef struct {
  __IO uint32_t LCD_GCR;                           /**< LCD General Control Register, offset: 0x0 */
  __IO uint32_t LCD_AR;                            /**< LCD Auxiliary Register, offset: 0x4 */
  __IO uint32_t LCD_FDCR;                          /**< LCD Fault Detect Control Register, offset: 0x8 */
  __IO uint32_t LCD_FDSR;                          /**< LCD Fault Detect Status Register, offset: 0xC */
  __IO uint32_t LCD_PEN0;                          /**< LCD Pin Enable Register 0, offset: 0x10 */
  __IO uint32_t LCD_PEN1;                          /**< LCD Pin Enable Register 1, offset: 0x14 */
  __IO uint32_t LCD_BPEN0;                         /**< LCD Back Plane Enable Register 0, offset: 0x18 */
  __IO uint32_t LCD_BPEN1;                         /**< LCD Back Plane Enable Register 1, offset: 0x1C */
  __IO uint32_t LCD_WFTO[SLCD_LCDWFN_COUNT];       /**< LCD Waveform 3 to 0 Register..LCD Waveform 47 to 44 Register, array offset: 0x20, array step: 0x4 */
} SLCD_Type;

/* ----------------------------------------------------------------------------
   -- SLCD Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup SLCD_Register_Masks SLCD Register Masks
 * @{
 */

/*! @name LCD_GCR - LCD General Control Register */
/*! @{ */

#define SLCD_LCD_GCR_DUTY_MASK                   (0x3U)
#define SLCD_LCD_GCR_DUTY_SHIFT                  (0U)
/*! DUTY - LCD duty select
 *  0b00..Use 1 BP (1/1 duty cycle).
 *  0b01..Use 2 BP (1/2 duty cycle).
 *  0b10..Use 3 BP (1/3 duty cycle).
 *  0b11..Use 4 BP (1/4 duty cycle).(Default)
 */
#define SLCD_LCD_GCR_DUTY(x)                     (((uint32_t)(((uint32_t)(x)) << SLCD_LCD_GCR_DUTY_SHIFT)) & SLCD_LCD_GCR_DUTY_MASK)

#define SLCD_LCD_GCR_LCLK_MASK                   (0x38U)
#define SLCD_LCD_GCR_LCLK_SHIFT                  (3U)
/*! LCLK - LCD Clock Prescaler */
#define SLCD_LCD_GCR_LCLK(x)                     (((uint32_t)(((uint32_t)(x)) << SLCD_LCD_GCR_LCLK_SHIFT)) & SLCD_LCD_GCR_LCLK_MASK)

#define SLCD_LCD_GCR_LCDLP_MASK                  (0x40U)
#define SLCD_LCD_GCR_LCDLP_SHIFT                 (6U)
/*! LCDLP - LCD Low Power Waveform
 *  0b0..LCD driver drives standard waveforms.
 *  0b1..LCD driver drives low-power waveforms.
 */
#define SLCD_LCD_GCR_LCDLP(x)                    (((uint32_t)(((uint32_t)(x)) << SLCD_LCD_GCR_LCDLP_SHIFT)) & SLCD_LCD_GCR_LCDLP_MASK)

#define SLCD_LCD_GCR_LCDEN_MASK                  (0x80U)
#define SLCD_LCD_GCR_LCDEN_SHIFT                 (7U)
/*! LCDEN - LCD Driver Enable */
#define SLCD_LCD_GCR_LCDEN(x)                    (((uint32_t)(((uint32_t)(x)) << SLCD_LCD_GCR_LCDEN_SHIFT)) & SLCD_LCD_GCR_LCDEN_MASK)

#define SLCD_LCD_GCR_LCDSTP_MASK                 (0x100U)
#define SLCD_LCD_GCR_LCDSTP_SHIFT                (8U)
/*! LCDSTP - LCD Stop
 *  0b0..Allows the LCD driver to continue running during Stop mode.
 *  0b1..Disables the LCD driver when MCU enters Stop mode.
 */
#define SLCD_LCD_GCR_LCDSTP(x)                   (((uint32_t)(((uint32_t)(x)) << SLCD_LCD_GCR_LCDSTP_SHIFT)) & SLCD_LCD_GCR_LCDSTP_MASK)

#define SLCD_LCD_GCR_LCDDOZE_MASK                (0x200U)
#define SLCD_LCD_GCR_LCDDOZE_SHIFT               (9U)
/*! LCDDOZE - LCD Doze enable
 *  0b0..Allows the LCD driver to continue running during Doze mode.
 *  0b1..Disables the LCD driver when MCU enters Doze mode.
 */
#define SLCD_LCD_GCR_LCDDOZE(x)                  (((uint32_t)(((uint32_t)(x)) << SLCD_LCD_GCR_LCDDOZE_SHIFT)) & SLCD_LCD_GCR_LCDDOZE_MASK)

#define SLCD_LCD_GCR_FDCIEN_MASK                 (0x4000U)
#define SLCD_LCD_GCR_FDCIEN_SHIFT                (14U)
/*! FDCIEN - LCD Fault Detection Complete Interrupt Enable
 *  0b0..No interrupt request is generated by this event.
 *  0b1..When a fault is detected and FDCF bit is set, this event causes an interrupt request.
 */
#define SLCD_LCD_GCR_FDCIEN(x)                   (((uint32_t)(((uint32_t)(x)) << SLCD_LCD_GCR_FDCIEN_SHIFT)) & SLCD_LCD_GCR_FDCIEN_MASK)

#define SLCD_LCD_GCR_LCDIEN_MASK                 (0x8000U)
#define SLCD_LCD_GCR_LCDIEN_SHIFT                (15U)
/*! LCDIEN - LCD Frame Frequency Interrupt Enable
 *  0b0..No interrupt request is generated by this event.
 *  0b1..When LCDIF bit is set, this event causes an interrupt request.
 */
#define SLCD_LCD_GCR_LCDIEN(x)                   (((uint32_t)(((uint32_t)(x)) << SLCD_LCD_GCR_LCDIEN_SHIFT)) & SLCD_LCD_GCR_LCDIEN_MASK)

