zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXA/periph2/PERI_SLCD.h
#define SLCD_LCD_PEN1_PIN_37_EN_MASK             (0x20U)
#define SLCD_LCD_PEN1_PIN_37_EN_SHIFT            (5U)
/*! PIN_37_EN - LCD Pin 37 Enable
 *  0b0..Pin Disable
 *  0b1..Pin Enable
 */
#define SLCD_LCD_PEN1_PIN_37_EN(x)               (((uint32_t)(((uint32_t)(x)) << SLCD_LCD_PEN1_PIN_37_EN_SHIFT)) & SLCD_LCD_PEN1_PIN_37_EN_MASK)

#define SLCD_LCD_PEN1_PIN_38_EN_MASK             (0x40U)
#define SLCD_LCD_PEN1_PIN_38_EN_SHIFT            (6U)
/*! PIN_38_EN - LCD Pin 38 Enable
 *  0b0..Pin Disable
 *  0b1..Pin Enable
 */
#define SLCD_LCD_PEN1_PIN_38_EN(x)               (((uint32_t)(((uint32_t)(x)) << SLCD_LCD_PEN1_PIN_38_EN_SHIFT)) & SLCD_LCD_PEN1_PIN_38_EN_MASK)

#define SLCD_LCD_PEN1_PIN_39_EN_MASK             (0x80U)
#define SLCD_LCD_PEN1_PIN_39_EN_SHIFT            (7U)
/*! PIN_39_EN - LCD Pin 39 Enable
 *  0b0..Pin Disable
 *  0b1..Pin Enable
 */
#define SLCD_LCD_PEN1_PIN_39_EN(x)               (((uint32_t)(((uint32_t)(x)) << SLCD_LCD_PEN1_PIN_39_EN_SHIFT)) & SLCD_LCD_PEN1_PIN_39_EN_MASK)

#define SLCD_LCD_PEN1_PIN_40_EN_MASK             (0x100U)
#define SLCD_LCD_PEN1_PIN_40_EN_SHIFT            (8U)
/*! PIN_40_EN - LCD Pin 40 Enable
 *  0b0..Pin Disable
 *  0b1..Pin Enable
 */
#define SLCD_LCD_PEN1_PIN_40_EN(x)               (((uint32_t)(((uint32_t)(x)) << SLCD_LCD_PEN1_PIN_40_EN_SHIFT)) & SLCD_LCD_PEN1_PIN_40_EN_MASK)

#define SLCD_LCD_PEN1_PIN_41_EN_MASK             (0x200U)
#define SLCD_LCD_PEN1_PIN_41_EN_SHIFT            (9U)
/*! PIN_41_EN - LCD Pin 41 Enable
 *  0b0..Pin Disable
 *  0b1..Pin Enable
 */
#define SLCD_LCD_PEN1_PIN_41_EN(x)               (((uint32_t)(((uint32_t)(x)) << SLCD_LCD_PEN1_PIN_41_EN_SHIFT)) & SLCD_LCD_PEN1_PIN_41_EN_MASK)

#define SLCD_LCD_PEN1_PIN_42_EN_MASK             (0x400U)
#define SLCD_LCD_PEN1_PIN_42_EN_SHIFT            (10U)
/*! PIN_42_EN - LCD Pin 42 Enable
 *  0b0..Pin Disable
 *  0b1..Pin Enable
 */
#define SLCD_LCD_PEN1_PIN_42_EN(x)               (((uint32_t)(((uint32_t)(x)) << SLCD_LCD_PEN1_PIN_42_EN_SHIFT)) & SLCD_LCD_PEN1_PIN_42_EN_MASK)

#define SLCD_LCD_PEN1_PIN_43_EN_MASK             (0x800U)
#define SLCD_LCD_PEN1_PIN_43_EN_SHIFT            (11U)
/*! PIN_43_EN - LCD Pin 43 Enable
 *  0b0..Pin Disable
 *  0b1..Pin Enable
 */
#define SLCD_LCD_PEN1_PIN_43_EN(x)               (((uint32_t)(((uint32_t)(x)) << SLCD_LCD_PEN1_PIN_43_EN_SHIFT)) & SLCD_LCD_PEN1_PIN_43_EN_MASK)

#define SLCD_LCD_PEN1_PIN_44_EN_MASK             (0x1000U)
#define SLCD_LCD_PEN1_PIN_44_EN_SHIFT            (12U)
/*! PIN_44_EN - LCD Pin 44 Enable
 *  0b0..Pin Disable
 *  0b1..Pin Enable
 */
#define SLCD_LCD_PEN1_PIN_44_EN(x)               (((uint32_t)(((uint32_t)(x)) << SLCD_LCD_PEN1_PIN_44_EN_SHIFT)) & SLCD_LCD_PEN1_PIN_44_EN_MASK)

#define SLCD_LCD_PEN1_PIN_45_EN_MASK             (0x2000U)
#define SLCD_LCD_PEN1_PIN_45_EN_SHIFT            (13U)
/*! PIN_45_EN - LCD Pin 45 Enable
 *  0b0..Pin Disable
 *  0b1..Pin Enable
 */
#define SLCD_LCD_PEN1_PIN_45_EN(x)               (((uint32_t)(((uint32_t)(x)) << SLCD_LCD_PEN1_PIN_45_EN_SHIFT)) & SLCD_LCD_PEN1_PIN_45_EN_MASK)

#define SLCD_LCD_PEN1_PIN_46_EN_MASK             (0x4000U)
#define SLCD_LCD_PEN1_PIN_46_EN_SHIFT            (14U)
/*! PIN_46_EN - LCD Pin 46 Enable
 *  0b0..Pin Disable
 *  0b1..Pin Enable
 */
#define SLCD_LCD_PEN1_PIN_46_EN(x)               (((uint32_t)(((uint32_t)(x)) << SLCD_LCD_PEN1_PIN_46_EN_SHIFT)) & SLCD_LCD_PEN1_PIN_46_EN_MASK)

#define SLCD_LCD_PEN1_PIN_47_EN_MASK             (0x8000U)
#define SLCD_LCD_PEN1_PIN_47_EN_SHIFT            (15U)
/*! PIN_47_EN - LCD Pin 47 Enable
 *  0b0..Pin Disable
 *  0b1..Pin Enable
 */
#define SLCD_LCD_PEN1_PIN_47_EN(x)               (((uint32_t)(((uint32_t)(x)) << SLCD_LCD_PEN1_PIN_47_EN_SHIFT)) & SLCD_LCD_PEN1_PIN_47_EN_MASK)
/*! @} */

/*! @name LCD_BPEN0 - LCD Back Plane Enable Register 0 */
/*! @{ */

#define SLCD_LCD_BPEN0_PIN_0_BPEN_MASK           (0x1U)
#define SLCD_LCD_BPEN0_PIN_0_BPEN_SHIFT          (0U)
/*! PIN_0_BPEN - LCD Pin 0 Back Plane Enable
 *  0b0..Pin as front plane.
 *  0b1..Pin as back plane.
 */
#define SLCD_LCD_BPEN0_PIN_0_BPEN(x)             (((uint32_t)(((uint32_t)(x)) << SLCD_LCD_BPEN0_PIN_0_BPEN_SHIFT)) & SLCD_LCD_BPEN0_PIN_0_BPEN_MASK)

#define SLCD_LCD_BPEN0_PIN_1_BPEN_MASK           (0x2U)
#define SLCD_LCD_BPEN0_PIN_1_BPEN_SHIFT          (1U)
/*! PIN_1_BPEN - LCD Pin 1 Back Plane Enable
 *  0b0..Pin as front plane.
 *  0b1..Pin as back plane.
 */
#define SLCD_LCD_BPEN0_PIN_1_BPEN(x)             (((uint32_t)(((uint32_t)(x)) << SLCD_LCD_BPEN0_PIN_1_BPEN_SHIFT)) & SLCD_LCD_BPEN0_PIN_1_BPEN_MASK)

#define SLCD_LCD_BPEN0_PIN_2_BPEN_MASK           (0x4U)
#define SLCD_LCD_BPEN0_PIN_2_BPEN_SHIFT          (2U)
/*! PIN_2_BPEN - LCD Pin 2 Back Plane Enable
 *  0b0..Pin as front plane.
 *  0b1..Pin as back plane.
 */
#define SLCD_LCD_BPEN0_PIN_2_BPEN(x)             (((uint32_t)(((uint32_t)(x)) << SLCD_LCD_BPEN0_PIN_2_BPEN_SHIFT)) & SLCD_LCD_BPEN0_PIN_2_BPEN_MASK)

#define SLCD_LCD_BPEN0_PIN_3_BPEN_MASK           (0x8U)
#define SLCD_LCD_BPEN0_PIN_3_BPEN_SHIFT          (3U)
/*! PIN_3_BPEN - LCD Pin 3 Back Plane Enable
 *  0b0..Pin as front plane.
 *  0b1..Pin as back plane.
 */
#define SLCD_LCD_BPEN0_PIN_3_BPEN(x)             (((uint32_t)(((uint32_t)(x)) << SLCD_LCD_BPEN0_PIN_3_BPEN_SHIFT)) & SLCD_LCD_BPEN0_PIN_3_BPEN_MASK)

#define SLCD_LCD_BPEN0_PIN_4_BPEN_MASK           (0x10U)
#define SLCD_LCD_BPEN0_PIN_4_BPEN_SHIFT          (4U)
/*! PIN_4_BPEN - LCD Pin 4 Back Plane Enable
 *  0b0..Pin as front plane.
 *  0b1..Pin as back plane.
 */
#define SLCD_LCD_BPEN0_PIN_4_BPEN(x)             (((uint32_t)(((uint32_t)(x)) << SLCD_LCD_BPEN0_PIN_4_BPEN_SHIFT)) & SLCD_LCD_BPEN0_PIN_4_BPEN_MASK)

#define SLCD_LCD_BPEN0_PIN_5_BPEN_MASK           (0x20U)
#define SLCD_LCD_BPEN0_PIN_5_BPEN_SHIFT          (5U)
/*! PIN_5_BPEN - LCD Pin 5 Back Plane Enable
 *  0b0..Pin as front plane.
 *  0b1..Pin as back plane.
 */
#define SLCD_LCD_BPEN0_PIN_5_BPEN(x)             (((uint32_t)(((uint32_t)(x)) << SLCD_LCD_BPEN0_PIN_5_BPEN_SHIFT)) & SLCD_LCD_BPEN0_PIN_5_BPEN_MASK)

#define SLCD_LCD_BPEN0_PIN_6_BPEN_MASK           (0x40U)
#define SLCD_LCD_BPEN0_PIN_6_BPEN_SHIFT          (6U)
/*! PIN_6_BPEN - LCD Pin 6 Back Plane Enable
 *  0b0..Pin as front plane.
 *  0b1..Pin as back plane.
 */
#define SLCD_LCD_BPEN0_PIN_6_BPEN(x)             (((uint32_t)(((uint32_t)(x)) << SLCD_LCD_BPEN0_PIN_6_BPEN_SHIFT)) & SLCD_LCD_BPEN0_PIN_6_BPEN_MASK)

#define SLCD_LCD_BPEN0_PIN_7_BPEN_MASK           (0x80U)
#define SLCD_LCD_BPEN0_PIN_7_BPEN_SHIFT          (7U)
/*! PIN_7_BPEN - LCD Pin 7 Back Plane Enable
 *  0b0..Pin as front plane.
 *  0b1..Pin as back plane.
 */
#define SLCD_LCD_BPEN0_PIN_7_BPEN(x)             (((uint32_t)(((uint32_t)(x)) << SLCD_LCD_BPEN0_PIN_7_BPEN_SHIFT)) & SLCD_LCD_BPEN0_PIN_7_BPEN_MASK)

#define SLCD_LCD_BPEN0_PIN_8_BPEN_MASK           (0x100U)
#define SLCD_LCD_BPEN0_PIN_8_BPEN_SHIFT          (8U)
/*! PIN_8_BPEN - LCD Pin 8 Back Plane Enable
 *  0b0..Pin as front plane.
 *  0b1..Pin as back plane.
 */
#define SLCD_LCD_BPEN0_PIN_8_BPEN(x)             (((uint32_t)(((uint32_t)(x)) << SLCD_LCD_BPEN0_PIN_8_BPEN_SHIFT)) & SLCD_LCD_BPEN0_PIN_8_BPEN_MASK)

#define SLCD_LCD_BPEN0_PIN_9_BPEN_MASK           (0x200U)
#define SLCD_LCD_BPEN0_PIN_9_BPEN_SHIFT          (9U)
/*! PIN_9_BPEN - LCD Pin 9 Back Plane Enable
 *  0b0..Pin as front plane.
 *  0b1..Pin as back plane.
 */
#define SLCD_LCD_BPEN0_PIN_9_BPEN(x)             (((uint32_t)(((uint32_t)(x)) << SLCD_LCD_BPEN0_PIN_9_BPEN_SHIFT)) & SLCD_LCD_BPEN0_PIN_9_BPEN_MASK)

#define SLCD_LCD_BPEN0_PIN_10_BPEN_MASK          (0x400U)
#define SLCD_LCD_BPEN0_PIN_10_BPEN_SHIFT         (10U)
/*! PIN_10_BPEN - LCD Pin 10 Back Plane Enable
 *  0b0..Pin as front plane.
 *  0b1..Pin as back plane.
 */
#define SLCD_LCD_BPEN0_PIN_10_BPEN(x)            (((uint32_t)(((uint32_t)(x)) << SLCD_LCD_BPEN0_PIN_10_BPEN_SHIFT)) & SLCD_LCD_BPEN0_PIN_10_BPEN_MASK)

#define SLCD_LCD_BPEN0_PIN_11_BPEN_MASK          (0x800U)
#define SLCD_LCD_BPEN0_PIN_11_BPEN_SHIFT         (11U)
/*! PIN_11_BPEN - LCD Pin 11 Back Plane Enable
 *  0b0..Pin as front plane.
 *  0b1..Pin as back plane.
 */
#define SLCD_LCD_BPEN0_PIN_11_BPEN(x)            (((uint32_t)(((uint32_t)(x)) << SLCD_LCD_BPEN0_PIN_11_BPEN_SHIFT)) & SLCD_LCD_BPEN0_PIN_11_BPEN_MASK)

#define SLCD_LCD_BPEN0_PIN_12_BPEN_MASK          (0x1000U)
#define SLCD_LCD_BPEN0_PIN_12_BPEN_SHIFT         (12U)
/*! PIN_12_BPEN - LCD Pin 12 Back Plane Enable
 *  0b0..Pin as front plane.
 *  0b1..Pin as back plane.
 */
#define SLCD_LCD_BPEN0_PIN_12_BPEN(x)            (((uint32_t)(((uint32_t)(x)) << SLCD_LCD_BPEN0_PIN_12_BPEN_SHIFT)) & SLCD_LCD_BPEN0_PIN_12_BPEN_MASK)

