zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXA/periph2/PERI_SLCD.h
#define SLCD_LCD_BPEN0_PIN_13_BPEN_MASK          (0x2000U)
#define SLCD_LCD_BPEN0_PIN_13_BPEN_SHIFT         (13U)
/*! PIN_13_BPEN - LCD Pin 13 Back Plane Enable
 *  0b0..Pin as front plane.
 *  0b1..Pin as back plane.
 */
#define SLCD_LCD_BPEN0_PIN_13_BPEN(x)            (((uint32_t)(((uint32_t)(x)) << SLCD_LCD_BPEN0_PIN_13_BPEN_SHIFT)) & SLCD_LCD_BPEN0_PIN_13_BPEN_MASK)

#define SLCD_LCD_BPEN0_PIN_14_BPEN_MASK          (0x4000U)
#define SLCD_LCD_BPEN0_PIN_14_BPEN_SHIFT         (14U)
/*! PIN_14_BPEN - LCD Pin 14 Back Plane Enable
 *  0b0..Pin as front plane.
 *  0b1..Pin as back plane.
 */
#define SLCD_LCD_BPEN0_PIN_14_BPEN(x)            (((uint32_t)(((uint32_t)(x)) << SLCD_LCD_BPEN0_PIN_14_BPEN_SHIFT)) & SLCD_LCD_BPEN0_PIN_14_BPEN_MASK)

#define SLCD_LCD_BPEN0_PIN_15_BPEN_MASK          (0x8000U)
#define SLCD_LCD_BPEN0_PIN_15_BPEN_SHIFT         (15U)
/*! PIN_15_BPEN - LCD Pin 15 Back Plane Enable
 *  0b0..Pin as front plane.
 *  0b1..Pin as back plane.
 */
#define SLCD_LCD_BPEN0_PIN_15_BPEN(x)            (((uint32_t)(((uint32_t)(x)) << SLCD_LCD_BPEN0_PIN_15_BPEN_SHIFT)) & SLCD_LCD_BPEN0_PIN_15_BPEN_MASK)

#define SLCD_LCD_BPEN0_PIN_16_BPEN_MASK          (0x10000U)
#define SLCD_LCD_BPEN0_PIN_16_BPEN_SHIFT         (16U)
/*! PIN_16_BPEN - LCD Pin 16 Back Plane Enable
 *  0b0..Pin as front plane.
 *  0b1..Pin as back plane.
 */
#define SLCD_LCD_BPEN0_PIN_16_BPEN(x)            (((uint32_t)(((uint32_t)(x)) << SLCD_LCD_BPEN0_PIN_16_BPEN_SHIFT)) & SLCD_LCD_BPEN0_PIN_16_BPEN_MASK)

#define SLCD_LCD_BPEN0_PIN_17_BPEN_MASK          (0x20000U)
#define SLCD_LCD_BPEN0_PIN_17_BPEN_SHIFT         (17U)
/*! PIN_17_BPEN - LCD Pin 17 Back Plane Enable
 *  0b0..Pin as front plane.
 *  0b1..Pin as back plane.
 */
#define SLCD_LCD_BPEN0_PIN_17_BPEN(x)            (((uint32_t)(((uint32_t)(x)) << SLCD_LCD_BPEN0_PIN_17_BPEN_SHIFT)) & SLCD_LCD_BPEN0_PIN_17_BPEN_MASK)

#define SLCD_LCD_BPEN0_PIN_18_BPEN_MASK          (0x40000U)
#define SLCD_LCD_BPEN0_PIN_18_BPEN_SHIFT         (18U)
/*! PIN_18_BPEN - LCD Pin 18 Back Plane Enable
 *  0b0..Pin as front plane.
 *  0b1..Pin as back plane.
 */
#define SLCD_LCD_BPEN0_PIN_18_BPEN(x)            (((uint32_t)(((uint32_t)(x)) << SLCD_LCD_BPEN0_PIN_18_BPEN_SHIFT)) & SLCD_LCD_BPEN0_PIN_18_BPEN_MASK)

#define SLCD_LCD_BPEN0_PIN_19_BPEN_MASK          (0x80000U)
#define SLCD_LCD_BPEN0_PIN_19_BPEN_SHIFT         (19U)
/*! PIN_19_BPEN - LCD Pin 19 Back Plane Enable
 *  0b0..Pin as front plane.
 *  0b1..Pin as back plane.
 */
#define SLCD_LCD_BPEN0_PIN_19_BPEN(x)            (((uint32_t)(((uint32_t)(x)) << SLCD_LCD_BPEN0_PIN_19_BPEN_SHIFT)) & SLCD_LCD_BPEN0_PIN_19_BPEN_MASK)

#define SLCD_LCD_BPEN0_PIN_20_BPEN_MASK          (0x100000U)
#define SLCD_LCD_BPEN0_PIN_20_BPEN_SHIFT         (20U)
/*! PIN_20_BPEN - LCD Pin 20 Back Plane Enable
 *  0b0..Pin as front plane.
 *  0b1..Pin as back plane.
 */
#define SLCD_LCD_BPEN0_PIN_20_BPEN(x)            (((uint32_t)(((uint32_t)(x)) << SLCD_LCD_BPEN0_PIN_20_BPEN_SHIFT)) & SLCD_LCD_BPEN0_PIN_20_BPEN_MASK)

#define SLCD_LCD_BPEN0_PIN_21_BPEN_MASK          (0x200000U)
#define SLCD_LCD_BPEN0_PIN_21_BPEN_SHIFT         (21U)
/*! PIN_21_BPEN - LCD Pin 21 Back Plane Enable
 *  0b0..Pin as front plane.
 *  0b1..Pin as back plane.
 */
#define SLCD_LCD_BPEN0_PIN_21_BPEN(x)            (((uint32_t)(((uint32_t)(x)) << SLCD_LCD_BPEN0_PIN_21_BPEN_SHIFT)) & SLCD_LCD_BPEN0_PIN_21_BPEN_MASK)

#define SLCD_LCD_BPEN0_PIN_22_BPEN_MASK          (0x400000U)
#define SLCD_LCD_BPEN0_PIN_22_BPEN_SHIFT         (22U)
/*! PIN_22_BPEN - LCD Pin 22 Back Plane Enable
 *  0b0..Pin as front plane.
 *  0b1..Pin as back plane.
 */
#define SLCD_LCD_BPEN0_PIN_22_BPEN(x)            (((uint32_t)(((uint32_t)(x)) << SLCD_LCD_BPEN0_PIN_22_BPEN_SHIFT)) & SLCD_LCD_BPEN0_PIN_22_BPEN_MASK)

#define SLCD_LCD_BPEN0_PIN_23_BPEN_MASK          (0x800000U)
#define SLCD_LCD_BPEN0_PIN_23_BPEN_SHIFT         (23U)
/*! PIN_23_BPEN - LCD Pin 23 Back Plane Enable
 *  0b0..Pin as front plane.
 *  0b1..Pin as back plane.
 */
#define SLCD_LCD_BPEN0_PIN_23_BPEN(x)            (((uint32_t)(((uint32_t)(x)) << SLCD_LCD_BPEN0_PIN_23_BPEN_SHIFT)) & SLCD_LCD_BPEN0_PIN_23_BPEN_MASK)

#define SLCD_LCD_BPEN0_PIN_24_BPEN_MASK          (0x1000000U)
#define SLCD_LCD_BPEN0_PIN_24_BPEN_SHIFT         (24U)
/*! PIN_24_BPEN - LCD Pin 24 Back Plane Enable
 *  0b0..Pin as front plane.
 *  0b1..Pin as back plane.
 */
#define SLCD_LCD_BPEN0_PIN_24_BPEN(x)            (((uint32_t)(((uint32_t)(x)) << SLCD_LCD_BPEN0_PIN_24_BPEN_SHIFT)) & SLCD_LCD_BPEN0_PIN_24_BPEN_MASK)

#define SLCD_LCD_BPEN0_PIN_25_BPEN_MASK          (0x2000000U)
#define SLCD_LCD_BPEN0_PIN_25_BPEN_SHIFT         (25U)
/*! PIN_25_BPEN - LCD Pin 25 Back Plane Enable
 *  0b0..Pin as front plane.
 *  0b1..Pin as back plane.
 */
#define SLCD_LCD_BPEN0_PIN_25_BPEN(x)            (((uint32_t)(((uint32_t)(x)) << SLCD_LCD_BPEN0_PIN_25_BPEN_SHIFT)) & SLCD_LCD_BPEN0_PIN_25_BPEN_MASK)

#define SLCD_LCD_BPEN0_PIN_26_BPEN_MASK          (0x4000000U)
#define SLCD_LCD_BPEN0_PIN_26_BPEN_SHIFT         (26U)
/*! PIN_26_BPEN - LCD Pin 26 Back Plane Enable
 *  0b0..Pin as front plane.
 *  0b1..Pin as back plane.
 */
#define SLCD_LCD_BPEN0_PIN_26_BPEN(x)            (((uint32_t)(((uint32_t)(x)) << SLCD_LCD_BPEN0_PIN_26_BPEN_SHIFT)) & SLCD_LCD_BPEN0_PIN_26_BPEN_MASK)

#define SLCD_LCD_BPEN0_PIN_27_BPEN_MASK          (0x8000000U)
#define SLCD_LCD_BPEN0_PIN_27_BPEN_SHIFT         (27U)
/*! PIN_27_BPEN - LCD Pin 27 Back Plane Enable
 *  0b0..Pin as front plane.
 *  0b1..Pin as back plane.
 */
#define SLCD_LCD_BPEN0_PIN_27_BPEN(x)            (((uint32_t)(((uint32_t)(x)) << SLCD_LCD_BPEN0_PIN_27_BPEN_SHIFT)) & SLCD_LCD_BPEN0_PIN_27_BPEN_MASK)

#define SLCD_LCD_BPEN0_PIN_28_BPEN_MASK          (0x10000000U)
#define SLCD_LCD_BPEN0_PIN_28_BPEN_SHIFT         (28U)
/*! PIN_28_BPEN - LCD Pin 28 Back Plane Enable
 *  0b0..Pin as front plane.
 *  0b1..Pin as back plane.
 */
#define SLCD_LCD_BPEN0_PIN_28_BPEN(x)            (((uint32_t)(((uint32_t)(x)) << SLCD_LCD_BPEN0_PIN_28_BPEN_SHIFT)) & SLCD_LCD_BPEN0_PIN_28_BPEN_MASK)

#define SLCD_LCD_BPEN0_PIN_29_BPEN_MASK          (0x20000000U)
#define SLCD_LCD_BPEN0_PIN_29_BPEN_SHIFT         (29U)
/*! PIN_29_BPEN - LCD Pin 29 Back Plane Enable
 *  0b0..Pin as front plane.
 *  0b1..Pin as back plane.
 */
#define SLCD_LCD_BPEN0_PIN_29_BPEN(x)            (((uint32_t)(((uint32_t)(x)) << SLCD_LCD_BPEN0_PIN_29_BPEN_SHIFT)) & SLCD_LCD_BPEN0_PIN_29_BPEN_MASK)

#define SLCD_LCD_BPEN0_PIN_30_BPEN_MASK          (0x40000000U)
#define SLCD_LCD_BPEN0_PIN_30_BPEN_SHIFT         (30U)
/*! PIN_30_BPEN - LCD Pin 30 Back Plane Enable
 *  0b0..Pin as front plane.
 *  0b1..Pin as back plane.
 */
#define SLCD_LCD_BPEN0_PIN_30_BPEN(x)            (((uint32_t)(((uint32_t)(x)) << SLCD_LCD_BPEN0_PIN_30_BPEN_SHIFT)) & SLCD_LCD_BPEN0_PIN_30_BPEN_MASK)

#define SLCD_LCD_BPEN0_PIN_31_BPEN_MASK          (0x80000000U)
#define SLCD_LCD_BPEN0_PIN_31_BPEN_SHIFT         (31U)
/*! PIN_31_BPEN - LCD Pin 31 Back Plane Enable
 *  0b0..Pin as front plane.
 *  0b1..Pin as back plane.
 */
#define SLCD_LCD_BPEN0_PIN_31_BPEN(x)            (((uint32_t)(((uint32_t)(x)) << SLCD_LCD_BPEN0_PIN_31_BPEN_SHIFT)) & SLCD_LCD_BPEN0_PIN_31_BPEN_MASK)
/*! @} */

