zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXA/periph2/PERI_SLCD.h
#define SLCD_LCDWFN_LCD_WFTO_WF0_MASK            (0xFFU)
#define SLCD_LCDWFN_LCD_WFTO_WF0_SHIFT           (0U)
/*! WF0 - Waveform Pin 0 */
#define SLCD_LCDWFN_LCD_WFTO_WF0(x)              (((uint32_t)(((uint32_t)(x)) << SLCD_LCDWFN_LCD_WFTO_WF0_SHIFT)) & SLCD_LCDWFN_LCD_WFTO_WF0_MASK)

#define SLCD_LCDWFN_LCD_WFTO_WF4_MASK            (0xFFU)
#define SLCD_LCDWFN_LCD_WFTO_WF4_SHIFT           (0U)
/*! WF4 - Waveform Pin 4 */
#define SLCD_LCDWFN_LCD_WFTO_WF4(x)              (((uint32_t)(((uint32_t)(x)) << SLCD_LCDWFN_LCD_WFTO_WF4_SHIFT)) & SLCD_LCDWFN_LCD_WFTO_WF4_MASK)

#define SLCD_LCDWFN_LCD_WFTO_WF8_MASK            (0xFFU)
#define SLCD_LCDWFN_LCD_WFTO_WF8_SHIFT           (0U)
/*! WF8 - Waveform Pin 8 */
#define SLCD_LCDWFN_LCD_WFTO_WF8(x)              (((uint32_t)(((uint32_t)(x)) << SLCD_LCDWFN_LCD_WFTO_WF8_SHIFT)) & SLCD_LCDWFN_LCD_WFTO_WF8_MASK)

#define SLCD_LCDWFN_LCD_WFTO_WF12_MASK           (0xFFU)
#define SLCD_LCDWFN_LCD_WFTO_WF12_SHIFT          (0U)
/*! WF12 - Waveform Pin 12 */
#define SLCD_LCDWFN_LCD_WFTO_WF12(x)             (((uint32_t)(((uint32_t)(x)) << SLCD_LCDWFN_LCD_WFTO_WF12_SHIFT)) & SLCD_LCDWFN_LCD_WFTO_WF12_MASK)

#define SLCD_LCDWFN_LCD_WFTO_WF16_MASK           (0xFFU)
#define SLCD_LCDWFN_LCD_WFTO_WF16_SHIFT          (0U)
/*! WF16 - Waveform Pin 16 */
#define SLCD_LCDWFN_LCD_WFTO_WF16(x)             (((uint32_t)(((uint32_t)(x)) << SLCD_LCDWFN_LCD_WFTO_WF16_SHIFT)) & SLCD_LCDWFN_LCD_WFTO_WF16_MASK)

#define SLCD_LCDWFN_LCD_WFTO_WF20_MASK           (0xFFU)
#define SLCD_LCDWFN_LCD_WFTO_WF20_SHIFT          (0U)
/*! WF20 - Waveform Pin 20 */
#define SLCD_LCDWFN_LCD_WFTO_WF20(x)             (((uint32_t)(((uint32_t)(x)) << SLCD_LCDWFN_LCD_WFTO_WF20_SHIFT)) & SLCD_LCDWFN_LCD_WFTO_WF20_MASK)

#define SLCD_LCDWFN_LCD_WFTO_WF24_MASK           (0xFFU)
#define SLCD_LCDWFN_LCD_WFTO_WF24_SHIFT          (0U)
/*! WF24 - Waveform Pin 24 */
#define SLCD_LCDWFN_LCD_WFTO_WF24(x)             (((uint32_t)(((uint32_t)(x)) << SLCD_LCDWFN_LCD_WFTO_WF24_SHIFT)) & SLCD_LCDWFN_LCD_WFTO_WF24_MASK)

#define SLCD_LCDWFN_LCD_WFTO_WF28_MASK           (0xFFU)
#define SLCD_LCDWFN_LCD_WFTO_WF28_SHIFT          (0U)
/*! WF28 - Waveform Pin 28 */
#define SLCD_LCDWFN_LCD_WFTO_WF28(x)             (((uint32_t)(((uint32_t)(x)) << SLCD_LCDWFN_LCD_WFTO_WF28_SHIFT)) & SLCD_LCDWFN_LCD_WFTO_WF28_MASK)

#define SLCD_LCDWFN_LCD_WFTO_WF32_MASK           (0xFFU)
#define SLCD_LCDWFN_LCD_WFTO_WF32_SHIFT          (0U)
/*! WF32 - Waveform Pin 32 */
#define SLCD_LCDWFN_LCD_WFTO_WF32(x)             (((uint32_t)(((uint32_t)(x)) << SLCD_LCDWFN_LCD_WFTO_WF32_SHIFT)) & SLCD_LCDWFN_LCD_WFTO_WF32_MASK)

#define SLCD_LCDWFN_LCD_WFTO_WF36_MASK           (0xFFU)
#define SLCD_LCDWFN_LCD_WFTO_WF36_SHIFT          (0U)
/*! WF36 - Waveform Pin 36 */
#define SLCD_LCDWFN_LCD_WFTO_WF36(x)             (((uint32_t)(((uint32_t)(x)) << SLCD_LCDWFN_LCD_WFTO_WF36_SHIFT)) & SLCD_LCDWFN_LCD_WFTO_WF36_MASK)

#define SLCD_LCDWFN_LCD_WFTO_WF40_MASK           (0xFFU)
#define SLCD_LCDWFN_LCD_WFTO_WF40_SHIFT          (0U)
/*! WF40 - Waveform Pin 40 */
#define SLCD_LCDWFN_LCD_WFTO_WF40(x)             (((uint32_t)(((uint32_t)(x)) << SLCD_LCDWFN_LCD_WFTO_WF40_SHIFT)) & SLCD_LCDWFN_LCD_WFTO_WF40_MASK)

#define SLCD_LCDWFN_LCD_WFTO_WF44_MASK           (0xFFU)
#define SLCD_LCDWFN_LCD_WFTO_WF44_SHIFT          (0U)
/*! WF44 - Waveform Pin 44 */
#define SLCD_LCDWFN_LCD_WFTO_WF44(x)             (((uint32_t)(((uint32_t)(x)) << SLCD_LCDWFN_LCD_WFTO_WF44_SHIFT)) & SLCD_LCDWFN_LCD_WFTO_WF44_MASK)

#define SLCD_LCDWFN_LCD_WFTO_WF1_MASK            (0xFF00U)
#define SLCD_LCDWFN_LCD_WFTO_WF1_SHIFT           (8U)
/*! WF1 - Waveform Pin 1 */
#define SLCD_LCDWFN_LCD_WFTO_WF1(x)              (((uint32_t)(((uint32_t)(x)) << SLCD_LCDWFN_LCD_WFTO_WF1_SHIFT)) & SLCD_LCDWFN_LCD_WFTO_WF1_MASK)

#define SLCD_LCDWFN_LCD_WFTO_WF5_MASK            (0xFF00U)
#define SLCD_LCDWFN_LCD_WFTO_WF5_SHIFT           (8U)
/*! WF5 - Waveform Pin 5 */
#define SLCD_LCDWFN_LCD_WFTO_WF5(x)              (((uint32_t)(((uint32_t)(x)) << SLCD_LCDWFN_LCD_WFTO_WF5_SHIFT)) & SLCD_LCDWFN_LCD_WFTO_WF5_MASK)

#define SLCD_LCDWFN_LCD_WFTO_WF9_MASK            (0xFF00U)
#define SLCD_LCDWFN_LCD_WFTO_WF9_SHIFT           (8U)
/*! WF9 - Waveform Pin 9 */
#define SLCD_LCDWFN_LCD_WFTO_WF9(x)              (((uint32_t)(((uint32_t)(x)) << SLCD_LCDWFN_LCD_WFTO_WF9_SHIFT)) & SLCD_LCDWFN_LCD_WFTO_WF9_MASK)

#define SLCD_LCDWFN_LCD_WFTO_WF13_MASK           (0xFF00U)
#define SLCD_LCDWFN_LCD_WFTO_WF13_SHIFT          (8U)
/*! WF13 - Waveform Pin 13 */
#define SLCD_LCDWFN_LCD_WFTO_WF13(x)             (((uint32_t)(((uint32_t)(x)) << SLCD_LCDWFN_LCD_WFTO_WF13_SHIFT)) & SLCD_LCDWFN_LCD_WFTO_WF13_MASK)

#define SLCD_LCDWFN_LCD_WFTO_WF17_MASK           (0xFF00U)
#define SLCD_LCDWFN_LCD_WFTO_WF17_SHIFT          (8U)
/*! WF17 - Waveform Pin 17 */
#define SLCD_LCDWFN_LCD_WFTO_WF17(x)             (((uint32_t)(((uint32_t)(x)) << SLCD_LCDWFN_LCD_WFTO_WF17_SHIFT)) & SLCD_LCDWFN_LCD_WFTO_WF17_MASK)

#define SLCD_LCDWFN_LCD_WFTO_WF21_MASK           (0xFF00U)
#define SLCD_LCDWFN_LCD_WFTO_WF21_SHIFT          (8U)
/*! WF21 - Waveform Pin 21 */
#define SLCD_LCDWFN_LCD_WFTO_WF21(x)             (((uint32_t)(((uint32_t)(x)) << SLCD_LCDWFN_LCD_WFTO_WF21_SHIFT)) & SLCD_LCDWFN_LCD_WFTO_WF21_MASK)

#define SLCD_LCDWFN_LCD_WFTO_WF25_MASK           (0xFF00U)
#define SLCD_LCDWFN_LCD_WFTO_WF25_SHIFT          (8U)
/*! WF25 - Waveform Pin 25 */
#define SLCD_LCDWFN_LCD_WFTO_WF25(x)             (((uint32_t)(((uint32_t)(x)) << SLCD_LCDWFN_LCD_WFTO_WF25_SHIFT)) & SLCD_LCDWFN_LCD_WFTO_WF25_MASK)

#define SLCD_LCDWFN_LCD_WFTO_WF29_MASK           (0xFF00U)
#define SLCD_LCDWFN_LCD_WFTO_WF29_SHIFT          (8U)
/*! WF29 - Waveform Pin 29 */
#define SLCD_LCDWFN_LCD_WFTO_WF29(x)             (((uint32_t)(((uint32_t)(x)) << SLCD_LCDWFN_LCD_WFTO_WF29_SHIFT)) & SLCD_LCDWFN_LCD_WFTO_WF29_MASK)

#define SLCD_LCDWFN_LCD_WFTO_WF33_MASK           (0xFF00U)
#define SLCD_LCDWFN_LCD_WFTO_WF33_SHIFT          (8U)
/*! WF33 - Waveform Pin 33 */
#define SLCD_LCDWFN_LCD_WFTO_WF33(x)             (((uint32_t)(((uint32_t)(x)) << SLCD_LCDWFN_LCD_WFTO_WF33_SHIFT)) & SLCD_LCDWFN_LCD_WFTO_WF33_MASK)

#define SLCD_LCDWFN_LCD_WFTO_WF37_MASK           (0xFF00U)
#define SLCD_LCDWFN_LCD_WFTO_WF37_SHIFT          (8U)
/*! WF37 - Waveform Pin 37 */
#define SLCD_LCDWFN_LCD_WFTO_WF37(x)             (((uint32_t)(((uint32_t)(x)) << SLCD_LCDWFN_LCD_WFTO_WF37_SHIFT)) & SLCD_LCDWFN_LCD_WFTO_WF37_MASK)

#define SLCD_LCDWFN_LCD_WFTO_WF41_MASK           (0xFF00U)
#define SLCD_LCDWFN_LCD_WFTO_WF41_SHIFT          (8U)
/*! WF41 - Waveform Pin 41 */
#define SLCD_LCDWFN_LCD_WFTO_WF41(x)             (((uint32_t)(((uint32_t)(x)) << SLCD_LCDWFN_LCD_WFTO_WF41_SHIFT)) & SLCD_LCDWFN_LCD_WFTO_WF41_MASK)

