zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXA/periph2/PERI_SLCD.h
#define SLCD_LCDWFN_LCD_WFTO_WF45_MASK           (0xFF00U)
#define SLCD_LCDWFN_LCD_WFTO_WF45_SHIFT          (8U)
/*! WF45 - Waveform Pin 45 */
#define SLCD_LCDWFN_LCD_WFTO_WF45(x)             (((uint32_t)(((uint32_t)(x)) << SLCD_LCDWFN_LCD_WFTO_WF45_SHIFT)) & SLCD_LCDWFN_LCD_WFTO_WF45_MASK)

#define SLCD_LCDWFN_LCD_WFTO_WF2_MASK            (0xFF0000U)
#define SLCD_LCDWFN_LCD_WFTO_WF2_SHIFT           (16U)
/*! WF2 - Waveform Pin 2 */
#define SLCD_LCDWFN_LCD_WFTO_WF2(x)              (((uint32_t)(((uint32_t)(x)) << SLCD_LCDWFN_LCD_WFTO_WF2_SHIFT)) & SLCD_LCDWFN_LCD_WFTO_WF2_MASK)

#define SLCD_LCDWFN_LCD_WFTO_WF6_MASK            (0xFF0000U)
#define SLCD_LCDWFN_LCD_WFTO_WF6_SHIFT           (16U)
/*! WF6 - Waveform Pin 6 */
#define SLCD_LCDWFN_LCD_WFTO_WF6(x)              (((uint32_t)(((uint32_t)(x)) << SLCD_LCDWFN_LCD_WFTO_WF6_SHIFT)) & SLCD_LCDWFN_LCD_WFTO_WF6_MASK)

#define SLCD_LCDWFN_LCD_WFTO_WF10_MASK           (0xFF0000U)
#define SLCD_LCDWFN_LCD_WFTO_WF10_SHIFT          (16U)
/*! WF10 - Waveform Pin 10 */
#define SLCD_LCDWFN_LCD_WFTO_WF10(x)             (((uint32_t)(((uint32_t)(x)) << SLCD_LCDWFN_LCD_WFTO_WF10_SHIFT)) & SLCD_LCDWFN_LCD_WFTO_WF10_MASK)

#define SLCD_LCDWFN_LCD_WFTO_WF14_MASK           (0xFF0000U)
#define SLCD_LCDWFN_LCD_WFTO_WF14_SHIFT          (16U)
/*! WF14 - Waveform Pin 14 */
#define SLCD_LCDWFN_LCD_WFTO_WF14(x)             (((uint32_t)(((uint32_t)(x)) << SLCD_LCDWFN_LCD_WFTO_WF14_SHIFT)) & SLCD_LCDWFN_LCD_WFTO_WF14_MASK)

#define SLCD_LCDWFN_LCD_WFTO_WF18_MASK           (0xFF0000U)
#define SLCD_LCDWFN_LCD_WFTO_WF18_SHIFT          (16U)
/*! WF18 - Waveform Pin 18 */
#define SLCD_LCDWFN_LCD_WFTO_WF18(x)             (((uint32_t)(((uint32_t)(x)) << SLCD_LCDWFN_LCD_WFTO_WF18_SHIFT)) & SLCD_LCDWFN_LCD_WFTO_WF18_MASK)

#define SLCD_LCDWFN_LCD_WFTO_WF22_MASK           (0xFF0000U)
#define SLCD_LCDWFN_LCD_WFTO_WF22_SHIFT          (16U)
/*! WF22 - Waveform Pin 22 */
#define SLCD_LCDWFN_LCD_WFTO_WF22(x)             (((uint32_t)(((uint32_t)(x)) << SLCD_LCDWFN_LCD_WFTO_WF22_SHIFT)) & SLCD_LCDWFN_LCD_WFTO_WF22_MASK)

#define SLCD_LCDWFN_LCD_WFTO_WF26_MASK           (0xFF0000U)
#define SLCD_LCDWFN_LCD_WFTO_WF26_SHIFT          (16U)
/*! WF26 - Waveform Pin 26 */
#define SLCD_LCDWFN_LCD_WFTO_WF26(x)             (((uint32_t)(((uint32_t)(x)) << SLCD_LCDWFN_LCD_WFTO_WF26_SHIFT)) & SLCD_LCDWFN_LCD_WFTO_WF26_MASK)

#define SLCD_LCDWFN_LCD_WFTO_WF30_MASK           (0xFF0000U)
#define SLCD_LCDWFN_LCD_WFTO_WF30_SHIFT          (16U)
/*! WF30 - Waveform Pin 30 */
#define SLCD_LCDWFN_LCD_WFTO_WF30(x)             (((uint32_t)(((uint32_t)(x)) << SLCD_LCDWFN_LCD_WFTO_WF30_SHIFT)) & SLCD_LCDWFN_LCD_WFTO_WF30_MASK)

#define SLCD_LCDWFN_LCD_WFTO_WF34_MASK           (0xFF0000U)
#define SLCD_LCDWFN_LCD_WFTO_WF34_SHIFT          (16U)
/*! WF34 - Waveform Pin 34 */
#define SLCD_LCDWFN_LCD_WFTO_WF34(x)             (((uint32_t)(((uint32_t)(x)) << SLCD_LCDWFN_LCD_WFTO_WF34_SHIFT)) & SLCD_LCDWFN_LCD_WFTO_WF34_MASK)

#define SLCD_LCDWFN_LCD_WFTO_WF38_MASK           (0xFF0000U)
#define SLCD_LCDWFN_LCD_WFTO_WF38_SHIFT          (16U)
/*! WF38 - Waveform Pin 38 */
#define SLCD_LCDWFN_LCD_WFTO_WF38(x)             (((uint32_t)(((uint32_t)(x)) << SLCD_LCDWFN_LCD_WFTO_WF38_SHIFT)) & SLCD_LCDWFN_LCD_WFTO_WF38_MASK)

#define SLCD_LCDWFN_LCD_WFTO_WF42_MASK           (0xFF0000U)
#define SLCD_LCDWFN_LCD_WFTO_WF42_SHIFT          (16U)
/*! WF42 - Waveform Pin 42 */
#define SLCD_LCDWFN_LCD_WFTO_WF42(x)             (((uint32_t)(((uint32_t)(x)) << SLCD_LCDWFN_LCD_WFTO_WF42_SHIFT)) & SLCD_LCDWFN_LCD_WFTO_WF42_MASK)

#define SLCD_LCDWFN_LCD_WFTO_WF46_MASK           (0xFF0000U)
#define SLCD_LCDWFN_LCD_WFTO_WF46_SHIFT          (16U)
/*! WF46 - Waveform Pin 46 */
#define SLCD_LCDWFN_LCD_WFTO_WF46(x)             (((uint32_t)(((uint32_t)(x)) << SLCD_LCDWFN_LCD_WFTO_WF46_SHIFT)) & SLCD_LCDWFN_LCD_WFTO_WF46_MASK)

#define SLCD_LCDWFN_LCD_WFTO_WF3_MASK            (0xFF000000U)
#define SLCD_LCDWFN_LCD_WFTO_WF3_SHIFT           (24U)
/*! WF3 - Waveform Pin 3 */
#define SLCD_LCDWFN_LCD_WFTO_WF3(x)              (((uint32_t)(((uint32_t)(x)) << SLCD_LCDWFN_LCD_WFTO_WF3_SHIFT)) & SLCD_LCDWFN_LCD_WFTO_WF3_MASK)

#define SLCD_LCDWFN_LCD_WFTO_WF7_MASK            (0xFF000000U)
#define SLCD_LCDWFN_LCD_WFTO_WF7_SHIFT           (24U)
/*! WF7 - Waveform Pin 7 */
#define SLCD_LCDWFN_LCD_WFTO_WF7(x)              (((uint32_t)(((uint32_t)(x)) << SLCD_LCDWFN_LCD_WFTO_WF7_SHIFT)) & SLCD_LCDWFN_LCD_WFTO_WF7_MASK)

#define SLCD_LCDWFN_LCD_WFTO_WF11_MASK           (0xFF000000U)
#define SLCD_LCDWFN_LCD_WFTO_WF11_SHIFT          (24U)
/*! WF11 - Waveform Pin 11 */
#define SLCD_LCDWFN_LCD_WFTO_WF11(x)             (((uint32_t)(((uint32_t)(x)) << SLCD_LCDWFN_LCD_WFTO_WF11_SHIFT)) & SLCD_LCDWFN_LCD_WFTO_WF11_MASK)

#define SLCD_LCDWFN_LCD_WFTO_WF15_MASK           (0xFF000000U)
#define SLCD_LCDWFN_LCD_WFTO_WF15_SHIFT          (24U)
/*! WF15 - Waveform Pin 15 */
#define SLCD_LCDWFN_LCD_WFTO_WF15(x)             (((uint32_t)(((uint32_t)(x)) << SLCD_LCDWFN_LCD_WFTO_WF15_SHIFT)) & SLCD_LCDWFN_LCD_WFTO_WF15_MASK)

#define SLCD_LCDWFN_LCD_WFTO_WF19_MASK           (0xFF000000U)
#define SLCD_LCDWFN_LCD_WFTO_WF19_SHIFT          (24U)
/*! WF19 - Waveform Pin 19 */
#define SLCD_LCDWFN_LCD_WFTO_WF19(x)             (((uint32_t)(((uint32_t)(x)) << SLCD_LCDWFN_LCD_WFTO_WF19_SHIFT)) & SLCD_LCDWFN_LCD_WFTO_WF19_MASK)

#define SLCD_LCDWFN_LCD_WFTO_WF23_MASK           (0xFF000000U)
#define SLCD_LCDWFN_LCD_WFTO_WF23_SHIFT          (24U)
/*! WF23 - Waveform Pin 23 */
#define SLCD_LCDWFN_LCD_WFTO_WF23(x)             (((uint32_t)(((uint32_t)(x)) << SLCD_LCDWFN_LCD_WFTO_WF23_SHIFT)) & SLCD_LCDWFN_LCD_WFTO_WF23_MASK)

#define SLCD_LCDWFN_LCD_WFTO_WF27_MASK           (0xFF000000U)
#define SLCD_LCDWFN_LCD_WFTO_WF27_SHIFT          (24U)
/*! WF27 - Waveform Pin 27 */
#define SLCD_LCDWFN_LCD_WFTO_WF27(x)             (((uint32_t)(((uint32_t)(x)) << SLCD_LCDWFN_LCD_WFTO_WF27_SHIFT)) & SLCD_LCDWFN_LCD_WFTO_WF27_MASK)

#define SLCD_LCDWFN_LCD_WFTO_WF31_MASK           (0xFF000000U)
#define SLCD_LCDWFN_LCD_WFTO_WF31_SHIFT          (24U)
/*! WF31 - Waveform Pin 31 */
#define SLCD_LCDWFN_LCD_WFTO_WF31(x)             (((uint32_t)(((uint32_t)(x)) << SLCD_LCDWFN_LCD_WFTO_WF31_SHIFT)) & SLCD_LCDWFN_LCD_WFTO_WF31_MASK)

#define SLCD_LCDWFN_LCD_WFTO_WF35_MASK           (0xFF000000U)
#define SLCD_LCDWFN_LCD_WFTO_WF35_SHIFT          (24U)
/*! WF35 - Waveform Pin 35 */
#define SLCD_LCDWFN_LCD_WFTO_WF35(x)             (((uint32_t)(((uint32_t)(x)) << SLCD_LCDWFN_LCD_WFTO_WF35_SHIFT)) & SLCD_LCDWFN_LCD_WFTO_WF35_MASK)

#define SLCD_LCDWFN_LCD_WFTO_WF39_MASK           (0xFF000000U)
#define SLCD_LCDWFN_LCD_WFTO_WF39_SHIFT          (24U)
/*! WF39 - Waveform Pin 39 */
#define SLCD_LCDWFN_LCD_WFTO_WF39(x)             (((uint32_t)(((uint32_t)(x)) << SLCD_LCDWFN_LCD_WFTO_WF39_SHIFT)) & SLCD_LCDWFN_LCD_WFTO_WF39_MASK)

#define SLCD_LCDWFN_LCD_WFTO_WF43_MASK           (0xFF000000U)
#define SLCD_LCDWFN_LCD_WFTO_WF43_SHIFT          (24U)
/*! WF43 - Waveform Pin 43 */
#define SLCD_LCDWFN_LCD_WFTO_WF43(x)             (((uint32_t)(((uint32_t)(x)) << SLCD_LCDWFN_LCD_WFTO_WF43_SHIFT)) & SLCD_LCDWFN_LCD_WFTO_WF43_MASK)

#define SLCD_LCDWFN_LCD_WFTO_WF47_MASK           (0xFF000000U)
#define SLCD_LCDWFN_LCD_WFTO_WF47_SHIFT          (24U)
/*! WF47 - Waveform Pin 47 */
#define SLCD_LCDWFN_LCD_WFTO_WF47(x)             (((uint32_t)(((uint32_t)(x)) << SLCD_LCDWFN_LCD_WFTO_WF47_SHIFT)) & SLCD_LCDWFN_LCD_WFTO_WF47_MASK)
/*! @} */

/* The count of SLCD_LCDWFN_LCD_WFTO */
#define SLCD_LCDWFN_LCD_WFTO_COUNT               (12U)


/*!
 * @}
 */ /* end of group SLCD_Register_Masks */


/*!
 * @}
 */ /* end of group SLCD_Peripheral_Access_Layer */


/*
** End of section using anonymous unions
*/

#if defined(__ARMCC_VERSION)
  #if (__ARMCC_VERSION >= 6010050)
    #pragma clang diagnostic pop
  #else
    #pragma pop
  #endif
#elif defined(__GNUC__)
  /* leave anonymous unions enabled */
#elif defined(__IAR_SYSTEMS_ICC__)
  #pragma language=default
#else
  #error Not supported compiler type
#endif

/*!
 * @}
 */ /* end of group Peripheral_access_layer */


#endif  /* SLCD_H_ */

